srcs/app/controllers/chatroom_controller.rb

	def parse_params
		puts "In parse_params, params is #{params}"
		@current_user = User.find_by(log_token: encrypt(cookies[:log_token])) rescue nil
---
SELECT "users".* FROM "users" WHERE "users"."log_token" = $1 LIMIT $2  [["log_token", "39665426"], ["LIMIT", 1]]