srcs/app/controllers/chat_controller.rb

INSERT INTO "messages" ("user_id", "msg", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["msg", "joi"], ["created_at", "2021-03-17 09:19:25.954066"], ["updated_at", "2021-03-17 09:19:25.954066"]]
---
	def send_dm
		unless @current_user and @target_user
			return render json: { error: "Cannot find current user" }, status: :internal_server_error
		end
		if @raw_message == nil or @raw_message.empty?
			return invalid_message
		end
                if (!validate_input(@raw_message))
			return render json: { error: "Your message contains forbidden characters" }, status: :bad_request
                end
		@message = Message.create(msg: @raw_message, user: @current_user)

SELECT "users".* FROM "users" WHERE "users"."log_token" = $1 LIMIT $2  [["log_token", "70529535"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def set_users_please
		STDERR.puts("in ChatController::new, params is #{params} and cookies is #{cookies}")
		@current_user = User.find_by(log_token: encrypt(cookies[:log_token])) rescue nil
		if params[:action] == "send_groupmessage"
			@groupchat = Chatroom.find(params[:chatroom_id])
		else
			@target_user = User.find_by(id: params[:other_user_id]) rescue nil