srcs/app/controllers/friendships_controller.rb

UPDATE "users" SET "last_seen" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_seen", "2021-03-16 23:26:51.197393"], ["updated_at", "2021-03-16 23:26:51.209931"], ["id", 5]]
SELECT "users".* FROM "users"
SELECT "friendships"."friend_id" FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 5]]
---
  def not_friends
    @current_user.last_seen = DateTime.now
    @current_user.save
    @users = User.all.where.not(:id => @current_user.id)
    @users = @users.all.where.not(:id => @current_user.friendships.pluck(:friend_id).reject { |x| x.nil? })

SELECT "users".* FROM "users"
---
  def connect_user
    User.all.each do |usr|