srcs/app/controllers/game_controller.rb

	def index
            games = Game.all.where(:tournament_id => nil)
            #Add only games which need to be played currently for each tournament
            Tournament.all.each do |tourn|
              if (tourn.games.count > 0)
---
SELECT "games".* FROM "games" WHERE "games"."tournament_id" IS NULL
SELECT "tournaments".* FROM "tournaments"

	def queue_ladder
		gametype = params[:queue_actiontype]
		return render json: { error: "Can't verify user" }, status: :unauthorized unless @user
		return render json: { error: "Bad gametype" }, status: :bad_request unless gametype == "ranked" || gametype == "casual"
		return render json: { error: "Error creating game, you must not already be in a game" }, status: :not_acceptable if Game.find_by(player2: @user, is_finished: false) or Game.find_by(player1: @user, is_finished: false)
		queueing_users = User.where(is_queueing: true).where.not(id: @user.id)
		if queueing_users.length > 0
			opponent = queueing_users.first
			opponent.update_column(:is_queueing, false)
			laddergame = Game.create(player1: opponent, name_player1: opponent.name, player2: @user, name_player2: @user.name, gametype: gametype)
			laddergame.mysetup
			laddergame.save
			NotificationChannel.broadcast_to(@user, {
				message: "Found you a ladder match, lil gangsta",
				redirection: "#game/#{laddergame.id}"
			})
			NotificationChannel.broadcast_to(opponent, {
				message: "Found you a ladder match, lil gangsta 2",
				redirection: "#game/#{laddergame.id}"
			})
			render json: { status: "Lets go broer" }, status: :ok
		else
			@user.update_attribute(:is_queueing, true)
---
SELECT "users".* FROM "users" WHERE "users"."is_queueing" = $1 AND "users"."id" != $2  [["is_queueing", true], ["id", 6]]
UPDATE "users" SET "is_queueing" = $1 WHERE "users"."id" = $2  [["is_queueing", false], ["id", 6]]
INSERT INTO "games" ("player1_id", "player2_id", "name_player1", "name_player2", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["player1_id", 6], ["player2_id", 7], ["name_player1", "Rechts"], ["name_player2", "Links"], ["created_at", "2021-03-16 23:31:13.807706"], ["updated_at", "2021-03-16 23:31:13.807706"]]
UPDATE "users" SET "is_queueing" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["is_queueing", true], ["updated_at", "2021-03-16 23:31:11.654592"], ["id", 6]]

	def set_params
		@user = User.find_by(log_token: encrypt(cookies[:log_token])) rescue nil
---
SELECT "users".* FROM "users" WHERE "users"."log_token" = $1 LIMIT $2  [["log_token", "39665426"], ["LIMIT", 1]]