srcs/app/controllers/notification_controller.rb

	def parse_params
		puts "In notificationcontroller, params is #{params}"
		@current_user = User.find_by(log_token: encrypt(cookies[:log_token])) rescue nil
---
SELECT "users".* FROM "users" WHERE "users"."log_token" = $1 LIMIT $2  [["log_token", "39665426"], ["LIMIT", 1]]

	def index # Get /api/notification.json
		render json: Notification.where(receiver: @current_user, is_accepted: false, is_declined: false), status: :ok
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."receiver_id" = $1 AND "notifications"."is_accepted" = $2 AND "notifications"."is_declined" = $3  [["receiver_id", 5], ["is_accepted", false], ["is_declined", false]]