srcs/app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."started" != $1  [["started", true]]
---
  def index_upcoming_tournaments
    @tournaments = Tournament.where.not(:started => true)

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."started" != $1  [["started", false]]
---
  def index_ongoing_tournaments
    @tournaments = Tournament.where.not(:started => false)

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def index_tournament_users
    tourn_id = cookies[:tourn_id].to_i
    users = Tournament.find_by(id: tourn_id)&.users

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
def index_tournament_current_game
  curr_game = nil
  tourn = Tournament.find(cookies[:tourn_id]) rescue nil