srcs/app/controllers/wars_controller.rb

SELECT "wars".* FROM "wars" WHERE "wars"."guild1_id" = $1 AND "wars"."guild2_id" = $2 ORDER BY "wars"."id" ASC LIMIT $3  [["guild1_id", 4], ["guild2_id", 3], ["LIMIT", 1]]
INSERT INTO "wars" ("guild1_id", "guild2_id", "start", "end", "prize", "wt_begin", "wt_end", "time_to_answer", "max_unanswered_match_calls", "ladder", "tournament", "duel", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
UPDATE "users" SET "last_seen" = $1 WHERE "users"."id" = $2  [["last_seen", "2021-03-16 23:32:54.165490"], ["id", 6]]
---
  def create
    if params[:prize].to_i > @current_user.guild.points or params[:prize].to_i > @opponent.points
      res_with_error("You or your opponent does not have enough points to commit to this war", :bad_request)
      return
    end
    if @current_user.guild_id == @opponent.id
      res_with_error("You cannot go to war with yourself", :bad_request)
      return
    end
    inverse_war = War.where(guild1_id: @current_user.guild.id, guild2_id: @opponent.id).first
    if inverse_war && !check_active_war
      @current_user.wars.create(guild2: @opponent, confirmed: true)
      inverse_war.confirmed = true
      inverse_war.save
    else
      @current_user.guild.wars.create(war_params)

SELECT "wars".* FROM "wars" WHERE "wars"."guild1_id" = $1 AND "wars"."guild2_id" = $2 ORDER BY "wars"."id" ASC LIMIT $3  [["guild1_id", 4], ["guild2_id", 3], ["LIMIT", 1]]
UPDATE "wars" SET "accepted" = $1, "updated_at" = $2 WHERE "wars"."id" = $3  [["accepted", true], ["updated_at", "2021-03-16 23:33:01.254028"], ["id", 1]]
---
  def accept_war
    # Check if not already in a war >> abort
    inverse_war = War.where(guild1_id: params[:id], guild2_id: @current_user.guild.id).first
    if inverse_war
      # Duplicate the inverse ware but with id's in reverse order and confirmed = true
      inverse_war.accepted = true
      inverse_war.save

SELECT "guilds".* FROM "guilds" WHERE "guilds"."id" = $1 ORDER BY "guilds"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_opponent_guild
    @opponent_guild_id = params[:guild2_id]
    @opponent = Guild.where(id: @opponent_guild_id).first

SELECT "users".* FROM "users"
---
  def connect_user
    User.all.each do |usr|