srcs/app/models/chatroom.rb

SELECT "chatrooms".* FROM "chatrooms"
SELECT "chatroom_members".* FROM "chatroom_members" WHERE "chatroom_members"."user_id" = $1 AND "chatroom_members"."chatroom_id" = $2 LIMIT $3  [["user_id", 5], ["chatroom_id", 1], ["LIMIT", 1]]
---
	def self.all_with_subscription_status(current_user)
		unless current_user
			return nil
		end
		obj = Chatroom.all
		obj.each do |o|
			if ChatroomMember.find_by(user: current_user, chatroom: o) != nil
				o.is_subscribed = true
			else
				o.is_subscribed = false
			end
			o.amount_members = o.members.length