srcs/app/models/game.rb

	def distribute_points(winner, loser, winner_name) # added winner_name in case the winning user is a practice bot
		@game.winner = winner_name
		@game.save
---
UPDATE "games" SET "winner" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["winner", "Links"], ["updated_at", "2021-03-16 23:31:26.560804"], ["id", 1]]

	def finish_game
		@status = "finished"

		if @players[0].score.to_i > @players[1].score.to_i
			@winner = @players[0].name
			winner_id = @players[0].user_id
			loser_id = @players[1].user_id
		else
			@winner = @players[1].name
			winner_id = @players[1].user_id
			loser_id = @players[0].user_id
		end
		@msg = "#{@winner} wins!"
    distribute_points(User.find_by(id: winner_id), User.find_by(id: loser_id), @winner)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]