srcs/app/models/guild.rb

  def add_points(amount)
    self.points += amount
    self.save
---
UPDATE "guilds" SET "points" = $1, "updated_at" = $2 WHERE "guilds"."id" = $3  [["points", 60], ["updated_at", "2021-03-16 23:35:24.854106"], ["id", 4]]