srcs/app/models/message.rb

SELECT "blocked_users".* FROM "blocked_users" WHERE "blocked_users"."user_id" = $1 AND "blocked_users"."towards_id" = $2 LIMIT $3  [["user_id", 2], ["towards_id", 3], ["LIMIT", 1]]
---
	def str(message_receiver)
		if message_receiver == self.user
			"[Me]: #{self.msg}"
		elsif message_receiver.blocked_users.find_by(towards: self.user) # elsif BlockedUser.find_by(user: message_receiver, towards: self.user)