srcs/app/channels/game_channel.rb

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def subscribed
		# STDERR.puts("In gamechannel::subscribed, params is #{params}")
		game_id = params[:game_id]
		stream_from "game_channel_#{game_id}"
		@@subscribers[game_id] ||= 0 # if it's nil, it'll be set to be 0, poggers
		@@subscribers[game_id] += 1

		@game = Game.find(game_id) rescue nil