app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."log_token" = $1 LIMIT $2  [["log_token", "351"], ["LIMIT", 1]]
UPDATE "users" SET "last_seen" = $1 WHERE "users"."id" = $2  [["last_seen", "2021-03-16 23:26:39.225331"], ["id", 3]]
---
  def set_last_seen
    current_user = User.find_by(log_token: encrypt(cookies[:log_token])) rescue nil
    if current_user
      if current_user.last_seen == nil or Time.now - current_user.last_seen > 20
        current_user.update_column(:last_seen, Time.now)