app/controllers/guilds_controller.rb

  def index
    @guilds = Guild.all
---
SELECT "guilds".* FROM "guilds"

  def users_available
    @current_user.last_seen = DateTime.now
    @current_user.save
    @users = User.all.where.not(:id => @current_user.id)
    @users = @users.all.where(:guild_id => nil)
---
UPDATE "users" SET "last_seen" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_seen", "2021-03-16 23:26:50.662103"], ["updated_at", "2021-03-16 23:26:50.668981"], ["id", 5]]
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" != $1 AND "users"."guild_id" IS NULL  [["id", 5]]

  def create
    puts "creating guild!"
    g_params = guild_params()
    if (!g_params)
      return false
    end

    @guild = @current_user.create_guild(guild_params)
    @current_user.guild_owner = true
    @current_user.guild_officer = true
    @current_user.guild_validated = true
    if @current_user.save and @guild
---
INSERT INTO "guilds" ("name", "anagram", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Linkies"], ["anagram", "li"], ["created_at", "2021-03-16 23:31:40.739507"], ["updated_at", "2021-03-16 23:31:40.739507"]]
UPDATE "users" SET "guild_id" = $1, "guild_owner" = $2, "guild_officer" = $3, "guild_validated" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["guild_id", 3], ["guild_owner", true], ["guild_officer", true], ["guild_validated", true], ["updated_at", "2021-03-16 23:31:40.819363"], ["id", 7]]

  def set_officer
    @user = User.find_by(id: params[:id])
    @user.guild_officer = true

    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" != $1 AND "users"."guild_id" IS NULL  [["id", 3]]
UPDATE "users" SET "last_seen" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_seen", "2021-03-16 23:28:59.174420"], ["updated_at", "2021-03-16 23:28:59.197575"], ["id", 3]]

  def connect_user
    User.all.each do |usr|
---
SELECT "users".* FROM "users"