app/controllers/home_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if (!cookies[:atoken].present?)
      cookies[:atoken] = get_auth_tok()
    end
    new_token = true
    User.all.each do |usr|
      if (cookies[:log_token].present? && cookies[:log_token] == decrypt(usr.log_token))
        new_token = false
        @user = usr
      end
    end
    if (new_token == true)
      @user = User.new
      @user.token = cookies[:atoken]
      def_name_used = false
      loop do
        @user.name = "New_User_" + ((rand() * 1000000).to_i).to_s
        User.all.each do |usr|

SELECT "users".* FROM "users"
---
      log_token_used = false
      loop do
        @n = ((rand() * 100000000).to_i).to_s
        User.all.each do |usr|

UPDATE "users" SET "last_seen" = $1 WHERE "users"."id" = $2  [["last_seen", "2021-03-16 23:26:39.225331"], ["id", 3]]
INSERT INTO "users" ("name", "token", "tfa", "reg_done", "created_at", "updated_at", "log_token", "email", "admin", "ban", "owner", "tourn_score", "tourn_win") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
      end
      @user.log_token = encrypt(@n)
      cookies[:log_token] = @n
      if @user.save()