app/controllers/profile_controller.rb

  def index_no_self
    @users = User.all.where.not(:id => @current_user.id)
---
SELECT "users".* FROM "users"

  def index_not_banned
    @users = User.all.where.not(:ban => true)
    @users = @users.where.not(:id => @current_user.id)
    @users = @users.where.not(:owner => true)
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."ban" != $1 AND "users"."id" != $2 AND "users"."owner" != $3  [["ban", true], ["id", 5], ["owner", true]]

  def index_not_admin
    @users = User.all.where.not(:admin => true)
---
SELECT "users".* FROM "users" WHERE "users"."admin" != $1  [["admin", true]]

  def index_admin_only
    @users = User.all.where.not(:admin => false)
    @users = @users.where.not(:owner => true)
---
SELECT "users".* FROM "users" WHERE "users"."admin" != $1  [["admin", true]]
SELECT "users".* FROM "users" WHERE "users"."admin" != $1 AND "users"."owner" != $2  [["admin", false], ["owner", true]]

  def changeAccount
   	if (!validate_input(params[:new_logtoken]))
      render json: {alert: "Input contains forbidden characters"}, status: :unprocessable_entity
		return
	end

	 User.all.each do |usr|
---
SELECT "users".* FROM "users"

  def update
    @user = User.find_by log_token: encrypt(cookies[:log_token])
    old_name = @user.name
	if (!validate_input(params[:name]))
      render json: {alert: "Username contains forbidden characters"}, status: :unprocessable_entity
		return
	end
	if (!validate_input(params[:email]))
      render json: {alert: "Email contains forbidden characters"}, status: :unprocessable_entity
		return
	end
    @user.name = params[:name]
    if (params[:img_path] == "")
      @user.img_path = "https://img2.cgtrader.com/items/2043799/e1982ff5ee/star-wars-rogue-one-solo-stormtrooper-helmet-3d-model-stl.jpg"
    else
      @user.img_path = params[:img_path]
    end
    @user.tfa = params[:tfa]
    @user.email = params[:email]
    @already_in_use = User.find_by name: params[:name]
    if @already_in_use && old_name != params[:name]
      render json: {alert: "Username is already taken"}, status: :unprocessable_entity
    elsif @user.save
---
SELECT "users".* FROM "users" WHERE "users"."log_token" = $1 LIMIT $2  [["log_token", "59673068"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Links"], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2, "email" = $3 WHERE "users"."id" = $4  [["name", "Links"], ["updated_at", "2021-03-16 23:30:51.991535"], ["email", "n"], ["id", 7]]

  def connect_user
    User.all.each do |usr|
---
SELECT "users".* FROM "users"