app/controllers/profile_controller.rb

SELECT "users".* FROM "users"
---
  def show
    User.all.each do |usr|

SELECT "users".* FROM "users" WHERE "users"."log_token" = $1 LIMIT $2  [["log_token", "12781986"], ["LIMIT", 1]]
---
  def update
    @user = User.find_by log_token: cookies[:log_token]