srcs/app/channels/application_cable/connection.rb

SELECT "users".* FROM "users" WHERE "users"."log_token" = $1 LIMIT $2  [["log_token", "39665426"], ["LIMIT", 1]]
---
		def find_verified_user
			if (current_user = User.find_by(log_token: encrypt(cookies[:log_token])))