app/models/war.rb

UPDATE "wars" SET "g2_points" = $1, "updated_at" = $2 WHERE "wars"."id" = $3  [["g2_points", 1], ["updated_at", "2021-03-16 23:35:25.022417"], ["id", 2]]
---
  def add_war_points(to_guild_id)
    if to_guild_id == self.guild1_id
      self.g1_points += 1
    elsif to_guild_id == self.guild2_id
      self.g2_points += 1
    end
    self.save