app/jobs/game_job.rb

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def perform(gameid)
		# @game_channel = gameid
		STDERR.puts("@game_channel is #{gameid}")
		@game = Game.find(gameid) rescue nil