app/jobs/setup_war_job.rb

SELECT "wars".* FROM "wars"
---
  def perform(*args)
    War.all.each do |war|